cylinder_bodyfitted2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal|pcorr"
    {
        solver          CG;
        preconditioner  Cholesky;
        minIter         1;
        maxIter         1000;
        tolerance       1e-7;
        relTol          0.0;
    }
    "U|UFinal"
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
    checkMeshCourantNo no;
    correctPhi yes;
}

PISO
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        U         1;
        UFinal    1;
    }
    fields
    {
    }
}

// ************************************************************************* //
